cracking-the-coding-interview/cracking-the-coding-interview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Cracking the Coding Interview</title>
<!-- 2014-12-02 二 15:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="马楠（nxmanan#gmail.com）" />
<meta  name="description" content="Cracking the Coding Interview笔记"
 />
<meta  name="keywords" content="Algorithm" />
<link rel="stylesheet" type="text/css" href="../style/emacs.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="http://manan.org"> HOME </a>
</div><div id="content">
<h1 class="title">Cracking the Coding Interview</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">资料</a>
<ul>
<li><a href="#sec-1-1">书</a></li>
<li><a href="#sec-1-2">网站</a></li>
<li><a href="#sec-1-3">题解</a></li>
</ul>
</li>
<li><a href="#sec-2">笔记</a>
<ul>
<li><a href="#sec-2-1">I. The Interview Process</a>
<ul>
<li><a href="#sec-2-1-1">Timeline and Preparation Map</a></li>
<li><a href="#sec-2-1-2">The Evaluation Process</a></li>
</ul>
</li>
<li><a href="#sec-2-2">II. Behind the Scenes</a></li>
<li><a href="#sec-2-3">III. Special Situations</a></li>
<li><a href="#sec-2-4">IV. Before the Interview</a></li>
<li><a href="#sec-2-5">V. Behavioral Questions</a></li>
<li><a href="#sec-2-6">VI. Technical Questions</a>
<ul>
<li><a href="#sec-2-6-1">Technical Preparation</a></li>
<li><a href="#sec-2-6-2">Handling technical questions</a></li>
<li><a href="#sec-2-6-3">Five algorithm approaches</a></li>
<li><a href="#sec-2-6-4">What good coding looks like</a></li>
</ul>
</li>
<li><a href="#sec-2-7">VII. The offer and beyond</a></li>
<li><a href="#sec-2-8">VIII. Interview Questions</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">资料</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">书</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>英文原版：Cracking the Coding Interview, 5th Edition
<ol class="org-ol">
<li>纸质版：<a href="http://www.amazon.com/Cracking-Coding-Interview-Programming-Questions/dp/098478280X">http://www.amazon.com/Cracking-Coding-Interview-Programming-Questions/dp/098478280X</a>
</li>
</ol>
</li>
<li>中文版：《程序员面试金典》，第五版
<ol class="org-ol">
<li>纸质版/Kindle版：<a href="http://www.amazon.cn/%E5%9B%BE%E4%B9%A6/dp/B00G8VOQOG">http://www.amazon.cn/%E5%9B%BE%E4%B9%A6/dp/B00G8VOQOG</a>
</li>
<li>图灵PDF版：<a href="http://www.ituring.com.cn/book/1010">http://www.ituring.com.cn/book/1010</a>
</li>
<li>豆瓣：<a href="http://book.douban.com/subject/25753386/">http://book.douban.com/subject/25753386/</a>
</li>
</ol>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">网站</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="http://www.crackingthecodinginterview.com/">http://www.crackingthecodinginterview.com/</a>
</li>
<li><a href="http://www.careercup.com/">http://www.careercup.com/</a>
</li>
</ul>
<p>
这两个网站上提供了一些面试资料，可以浏览一下。
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">题解</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>官方（第4版，Java）：<a href="http://www.careercup.com/careercup_book_solutions">http://www.careercup.com/careercup_book_solutions</a>
</li>
<li>官方各种语言版（第5版，部分语言代码不全）：<a href="https://github.com/gaylemcd/ctci">https://github.com/gaylemcd/ctci</a>
</li>
<li>C++版(by Hawstein)：<a href="https://github.com/Hawstein/cracking-the-coding-interview">https://github.com/Hawstein/cracking-the-coding-interview</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">笔记</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">I. The Interview Process</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1">Timeline and Preparation Map</h4>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2">The Evaluation Process</h4>
<div class="outline-text-4" id="text-2-1-2">
<ol class="org-ol">
<li>prior experience
</li>
<li>culture fit
</li>
<li>coding skills
</li>
<li>analytical ability
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">II. Behind the Scenes</h3>
<div class="outline-text-3" id="text-2-2">
<p>
各公司面试要点。
</p>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">III. Special Situations</h3>
<div class="outline-text-3" id="text-2-3">
<p>
测试、PM等
</p>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">IV. Before the Interview</h3>
<div class="outline-text-3" id="text-2-4">
<p>
对学生和职业人士的建议。
</p>

<p>
利用业余时间开发个人项目：just for fun.
</p>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5">V. Behavioral Questions</h3>
<div class="outline-text-3" id="text-2-5">
<p>
关于经历的各种问题，帮助了解你。
</p>

<p>
问题示例和解答技巧。
</p>
</div>
</div>
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6">VI. Technical Questions</h3>
<div class="outline-text-3" id="text-2-6">
</div><div id="outline-container-sec-2-6-1" class="outline-4">
<h4 id="sec-2-6-1">Technical Preparation</h4>
<div class="outline-text-4" id="text-2-6-1">
</div><ul class="org-ul"><li>How to practice a question<br  /><div class="outline-text-5" id="text-2-6-1-1">
<ol class="org-ol">
<li>独立完成，思考时空复杂度
</li>
<li>在纸上写出代码
</li>
<li>在纸上测试代码
</li>
<li>在计算机上输入代码并测试，记录出现的错误
</li>
</ol>
</div>
</li>

<li>What you need to know<br  /><div class="outline-text-5" id="text-2-6-1-2">
<ul class="org-ul">
<li>数据结构
</li>
<li>算法
</li>
<li>概念
</li>
</ul>

<p>
2的幂次表
</p>
</div>
</li></ul>
</div>

<div id="outline-container-sec-2-6-2" class="outline-4">
<h4 id="sec-2-6-2">Handling technical questions</h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
解决问题的5步：
</p>
<ol class="org-ol">
<li>询问面试官，消除歧义
</li>
<li>设计算法
</li>
<li>先写伪代码
</li>
<li>写代码
</li>
<li>测试代码，修改错误
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-6-3" class="outline-4">
<h4 id="sec-2-6-3">Five algorithm approaches</h4>
<div class="outline-text-4" id="text-2-6-3">
<p>
Keep in mind that the more problems you practice, the easier it will be to identify which approach to use.
</p>

<ul class="org-ul">
<li>Approach 1: Examplify 举例
</li>
<li>Approach 2: Pattern matching 寻找类似问题
</li>
<li>Approach 3: Simplify and Generalize 先简化再一般化
</li>
<li>Approach 4: Base case and build 递推
</li>
<li>Approach 5: Data structure brainstorm 数据结构头脑风暴
</li>
</ul>

<p>
Note that the more problems you do, the more developed your instinct on which data structure to apply will be.You will also develop a more finely tuned instinct as to which of these approaches is the most useful.
</p>
</div>
</div>

<div id="outline-container-sec-2-6-4" class="outline-4">
<h4 id="sec-2-6-4">What good coding looks like</h4>
<div class="outline-text-4" id="text-2-6-4">
<p>
Broadly speaking, good code has the following properties:
</p>
<ul class="org-ul">
<li>correct
</li>
<li>efficient
</li>
<li>simple
</li>
<li>readable
</li>
<li>maintainable
</li>
</ul>
</div>

<ul class="org-ul"><li>Use Data Structures Generously 使用数据结构<br  /></li>
<li>Appropriate code reuse 代码复用<br  /></li>
<li>Modular 模块化<br  /></li>
<li>Flexible and robust 灵活性和鲁棒性<br  /></li>
<li>Error checking 错误检查<br  /></li></ul>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7">VII. The offer and beyond</h3>
</div>
<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8"><a href="./interview-questions.html">VIII. Interview Questions</a></h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2014-11-26</p>
<p class="author">Author: 马楠（nxmanan#gmail.com）</p>
<p class="date">Created: 2014-12-02 二 15:47</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.7b)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
